---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCAnyHandle.TypeName
source: html/e569a28a-7990-3bcc-b591-abfe99b63f05.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.TypeName Property

The name of the type of the handle.

## Syntax (C#)
```csharp
public string TypeName { get; }
```